# 通过selenium自动打开浏览器，输入网址并点击进去
#以谷歌浏览器为例

# from selenium.webdriver import Chrome
#
# #创建浏览器对象
# #executable_path指定浏览器驱动的路径
# #web = Chrome(executable_path='./chromedriver.exe')
# web = Chrome()  #自动查找保存在python解释器同目录下的驱动信息
# url = 'https://www.baidu.com'
# web.get(url)
# page = web.page_source  #此处获取的是经过页面处理的源码信息，不是页面源代码，可通过此操作与xpath结合使用
# print(web.title)

# str = '车次:G7080'
# list = ['车次:D1668', '车次:G7032', '车次:G3124', '车次:D352', '车次:G7080', '车次:G1772', '车次:G7784', '车次:D636', '车次:G3230', '车次:D2928', '车次:G8262', '车次:G110', '车次:G1986', '车次:G1468', '车次:G2616', '车次:D2212', '车次:G8254', '车次:G7492', '车次:D3022', '车次:G7040', '车次:G7042', '车次:D3068', '车次:G7316', '车次:G7576', '车次:K2186', '车次:K1156', '车次:G7280', '车次:G7508', '车次:G2788', '车次:G1810', '车次:K464', '车次:D3026', '车次:G7320', '车次:G7390', '车次:G7050', '车次:K782', '车次:K738', '车次:K1806', '车次:G2612', '车次:D3142', '车次:D3014', '车次:Z176', '车次:G7592', '车次:K1328', '车次:G7206', '车次:G8258', '车次:G7192', '车次:K48', '车次:D3046', '车次:G7120', '车次:G7726', '车次:D3136', '车次:G7058', '车次:G7520', '车次:G7160', '车次:G7260', '车次:G8278', '车次:G7584', '车次:G7124', '车次:G7286', '车次:G7028', '车次:G7550', '车次:G7588', '车次:G7314', '车次:G7030']
# if str in list:
#     p = list.index(str) + 1
# print(p)
# print(len(list))



























